unit ConstMessage;

interface

Const
	C_Mess_License       = 'Програмата не е лицензирана!';
  C_Mess_Portfeil_Date = 'В портфейла имате инвестиция, която е направена след ';
  C_Mess_NotValue      = 'Въведете стойност.';
  C_Mess_NotNull       = 'Не може да въвеждате стойности по-малки или равни на 0.';
  C_Mess_SaveCorect    = 'Да запиша ли промяната?';
  C_Mess_PrinterReady  = 'Подготвихте ли принтера за печатане?';
  C_Mess_SortPodreden  = 'Преминете към състояние на "Подреден" портфейл.';
	C_Mess_CreateKarton  = 'Да възстановя ли данните?';
  C_Mess_RegKarton     = 'Не може да променяте първоначалните данни при регистриран вече доход и/или продажби.';
	C_Mess_NotRegInvest  = 'Няма регистрирани инвестиции!';
  C_Mess_NotDohod      = 'Няма регистриран доход.';
  C_Mess_DeleteZapis   = 'Потвърдете изтриването на записа.';
  C_Mess_ErroDate      = 'Грешно въведена дата.';
  C_Mess_DohodDatePred = 'Въведената дата за получения доход е преди датата, на която сте направели инвестицията!';
	C_Mess_DateCledCurr  = 'Въведената дата е след текущата дата!';
  C_Mess_DeleteInv     =
  		'Изтриването на инвестицията се извършва от картотеката.'+#13+
    	'Изтриването е операция, при която инвестицията се изважда от портфейла, '+
      'картотеката и списъка';
	C_Mess_NotRegProd    = 'Няма регистрирани продажби.';
  C_Mess_ProdDatePred  = 'Въведената дата за направената продажба е преди датата, на която сте направели инвестицията!';
	C_Mess_PeriodSelect  = 'Изберете период от формата.';
  C_Mess_Delete        = 'Потвърдете изтриването.';
  C_Mess_RotatePeriod  = 'Обърнете посоката на периода.';
  C_Mess_CurrDateSmall = 'Не може да въвеждате дата преди 01/01/1900';
  C_Mess_ArchiveData   = 'Архивирахте ли данните за инвестицията?';
  C_Mess_ErrorPassword = 'Неправилно въведана парола!';
  C_Mess_NotPassword   = 'Няма въведана парола.';
  C_Mess_CorectPassword= 'Потвърдете паролата.';
  C_Mess_OverrideFile  = 'Да презапишa ли файла?';
  C_Mess_ReadyOK       = 'Готово.';
  C_Mess_ArchiveOpen   = 'Данните при възстановяване от архив се записват върху текущия портфейл';
	C_Mess_InputName     = 'Въведете име.';
  C_Mess_InputFirma    = 'Въведете фирма.';
  C_Mess_ErrorNumber   = 'Неправилно въведен номер.';
  C_Mess_NotFindFile   = 'Липсва файла %s';
  C_Mess_NotReadFile   = 'Не може да прочете файла %s';
  C_Mess_OriginalDisk  = 'Дискетата не е от инсталациония пакет на Ariadna Portfeil 1.0';
  C_Mess_ReadOnlyDisk  = 'Дискетата е заключена. Преместете ключето на дискетата.';
  C_Mess_ByNowInstall=
  				'Програмата не може да бъде регистрирана защото е инсталирана. '+#13+
          'Трябва да деинсталирате предходната инсталация.';
	C_Mess_NoCreateKarton= 'Не може да създаде картона!';
  C_Mess_NotWritePass  = 'Не може да запише паролата!';
  C_Mess_NotPrinter    = 'Няма инсталиран принтер.';
  C_Mess_NotLicense    = 'Програмата не е регистрирана!';

implementation

end.
